---

C#Visual BasicVisual C++

Revit 2024 API
---
ReferenceIntersector..::..SetFilter Method
ReferenceIntersector Class See Also Send Feedback
---

Sets the ElementFilter used in intersection testing.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013

# Syntax

C#
---

    public void SetFilter(
    	ElementFilter filter
    )

Visual Basic
---

    Public Sub SetFilter ( _
    	filter As ElementFilter _
    )

Visual C++
---

    public:
    void SetFilter(
    	ElementFilter^ filter
    )

#### Parameters

filter
    Type: Autodesk.Revit.DB..::..ElementFilter The ElementFilter. Pass nullNothingnullptra null reference (Nothing in Visual Basic) to remove the existing filter.

# See Also

ReferenceIntersector Class

Autodesk.Revit.DB Namespace